# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [2]:
import numpy as np
import pandas as pd

### 2. Create a Pandas Series containing the elements of the list below.

In [4]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [6]:
ser = pd.Series(lst)

print(ser)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [7]:
ser[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [8]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [9]:
mat = pd.DataFrame(b)

In [10]:
print(mat)

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

In [11]:
mat.head()

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9

### 5. Rename the data frame columns based on the names in the list below.

In [12]:
nomes = ["nome1", "nome2", "nome3", "nome4", "nome5"]

In [13]:
mat.columns = nomes

In [14]:
print(mat)

   nome1  nome2  nome3  nome4  nome5
0   53.1   95.0   67.5   35.0   78.4
1   61.3   40.8   30.8   37.8   87.6
2   20.6   73.2   44.2   14.6   91.8
3   57.4    0.1   96.1    4.2   69.5
4   83.6   20.5   85.4   22.8   35.9
5   49.0   69.0    0.1   31.8   89.1
6   23.3   40.7   95.0   83.8   26.9
7   27.6   26.4   53.8   88.8   68.5
8   96.6   96.4   53.4   72.4   50.1
9   73.7   39.0   43.2   81.6   34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

### subset the data based on column's names

In [17]:
mat[["nome1", "nome3", "nome5"]]

   nome1  nome3  nome5
0   53.1   67.5   78.4
1   61.3   30.8   87.6
2   20.6   44.2   91.8
3   57.4   96.1   69.5
4   83.6   85.4   35.9
5   49.0    0.1   89.1
6   23.3   95.0   26.9
7   27.6   53.8   68.5
8   96.6   53.4   50.1
9   73.7   43.2   34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [18]:
mat['nome3'].mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [19]:
mat['nome4'].max()

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [20]:
mat['nome2'].median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [21]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [24]:
df = pd.DataFrame(orders)

df.head()

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [25]:
df[['Quantity','Revenue']].sum()

Quantity    2978.0
Revenue      637.0
dtype: float64

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [26]:
print(df['Revenue'].max()-df['Revenue'].min())

516.75

### 13. Now, play with your DataFrame:

In [35]:
mat.head(10)

   nome1  nome2  nome3  nome4  nome5
0   53.1   95.0   67.5   35.0   78.4
1   61.3   40.8   30.8   37.8   87.6
2   20.6   73.2   44.2   14.6   91.8
3   57.4    0.1   96.1    4.2   69.5
4   83.6   20.5   85.4   22.8   35.9
5   49.0   69.0    0.1   31.8   89.1
6   23.3   40.7   95.0   83.8   26.9
7   27.6   26.4   53.8   88.8   68.5
8   96.6   96.4   53.4   72.4   50.1
9   73.7   39.0   43.2   81.6   34.7

In [40]:
row_names = ["row1", "row2", "row3", "row4", "row5", "row6", "row7", "row8", "row9", "row10"]

In [41]:
mat.index = row_names

In [42]:
mat.head(10)

       nome1  nome2  nome3  nome4  nome5
row1    53.1   95.0   67.5   35.0   78.4
row2    61.3   40.8   30.8   37.8   87.6
row3    20.6   73.2   44.2   14.6   91.8
row4    57.4    0.1   96.1    4.2   69.5
row5    83.6   20.5   85.4   22.8   35.9
row6    49.0   69.0    0.1   31.8   89.1
row7    23.3   40.7   95.0   83.8   26.9
row8    27.6   26.4   53.8   88.8   68.5
row9    96.6   96.4   53.4   72.4   50.1
row10   73.7   39.0   43.2   81.6   34.7

In [44]:
mat.loc['row1']['nome1']

53.1

In [45]:
mat.corr()

          nome1     nome2     nome3     nome4     nome5
nome1  1.000000  0.087310 -0.003179 -0.031930 -0.326683
nome2  0.087310  1.000000 -0.429563  0.090649  0.285066
nome3 -0.003179 -0.429563  1.000000 -0.031707 -0.570449
nome4 -0.031930  0.090649 -0.031707  1.000000 -0.543161
nome5 -0.326683  0.285066 -0.570449 -0.543161  1.000000

In [46]:
mat.transpose().head()

       row1  row2  row3  row4  row5  row6  row7  row8  row9  row10
nome1  53.1  61.3  20.6  57.4  83.6  49.0  23.3  27.6  96.6   73.7
nome2  95.0  40.8  73.2   0.1  20.5  69.0  40.7  26.4  96.4   39.0
nome3  67.5  30.8  44.2  96.1  85.4   0.1  95.0  53.8  53.4   43.2
nome4  35.0  37.8  14.6   4.2  22.8  31.8  83.8  88.8  72.4   81.6
nome5  78.4  87.6  91.8  69.5  35.9  89.1  26.9  68.5  50.1   34.7

In [47]:
mat.corr()

          nome1     nome2     nome3     nome4     nome5
nome1  1.000000  0.087310 -0.003179 -0.031930 -0.326683
nome2  0.087310  1.000000 -0.429563  0.090649  0.285066
nome3 -0.003179 -0.429563  1.000000 -0.031707 -0.570449
nome4 -0.031930  0.090649 -0.031707  1.000000 -0.543161
nome5 -0.326683  0.285066 -0.570449 -0.543161  1.000000